src/InformationRegisters/ПланП_ЦенаДопОпераций/ПланП_ЦенаДопОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланП_ЦенаДопОпераций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЦенаОсновнойОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаА</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаА1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаА2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаА3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаА4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЦенаЗависитОтМатериала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИзДопОпераций</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВспомогательнаяОперация</name>
    <type>
      <types>CatalogRef.ПланП_ДопОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдИзм</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ФормулыРасчетаОпераций/ФормулыРасчетаОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФормулыРасчетаОпераций</name>
  <attributes>
    <name>А</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>А1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>А2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>А3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>А4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаА</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаА1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаА2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаА3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаА4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаЦены</name>
    <type>
      <types>EnumRef.ВариантыРасчетаЦена</types>
    </type>
  </attributes>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительнаяОперация</name>
    <type>
      <types>CatalogRef.ПланП_ДопОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Формула</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПланП_ЦенаДопОпераций/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Функция ПолучитьДополнительныеОперации(Операция)
	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
				  |	ФормулыРасчетаОпераций.ЦенаА КАК ЦенаА,
				  |	ФормулыРасчетаОпераций.ЦенаА1 КАК ЦенаА1,
				  |	ФормулыРасчетаОпераций.ЦенаА2 КАК ЦенаА2,
				  |	ФормулыРасчетаОпераций.ЦенаА3 КАК ЦенаА3,
				  |	ФормулыРасчетаОпераций.ЦенаА4 КАК ЦенаА4
				  |ИЗ
				  |	РегистрСведений.ФормулыРасчетаОпераций КАК ФормулыРасчетаОпераций
				  |ГДЕ
				  |	ФормулыРасчетаОпераций.Операция = &Операция";
	Запрос.Параметры.Вставить("Операция", Операция);
	Выборка=Запрос.Выполнить().Выбрать();
	Массив=Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтрДопОперации= Новый Структура;
		СтрДопОперации.Вставить("ЦенаА", Выборка.ЦенаА);
		СтрДопОперации.Вставить("ЦенаА1", Выборка.ЦенаА1);
		СтрДопОперации.Вставить("ЦенаА2", Выборка.ЦенаА2);
		СтрДопОперации.Вставить("ЦенаА3", Выборка.ЦенаА3);
		СтрДопОперации.Вставить("ЦенаА4", Выборка.ЦенаА4);
		Массив.Добавить(СтрДопОперации);
	КонецЦикла;
	Возврат Массив;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Запись.Период=ТекущаяДата();
	Запись.Автор = Пользователи.ТекущийПользователь();

КонецПроцедуры
&НаКлиенте
Процедура ИзменениеНаименованийКолонокДО(МассивДопОпер)
	Если МассивДопОпер.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если Не ПустаяСтрока(МассивДопОпер[0].ЦенаА) Тогда
		ЭтаФорма.Элементы.ЦенаА.Заголовок=МассивДопОпер[0].ЦенаА;
	КонецЕсли;
//1
	Если Не ПустаяСтрока(МассивДопОпер[0].ЦенаА1) Тогда
		ЭтаФорма.Элементы.ЦенаА1.Заголовок=МассивДопОпер[0].ЦенаА1;
	КонецЕсли;
//2
	Если Не ПустаяСтрока(МассивДопОпер[0].ЦенаА2) Тогда
		ЭтаФорма.Элементы.ЦенаА2.Заголовок=МассивДопОпер[0].ЦенаА2;
	КонецЕсли;
//3
	Если Не ПустаяСтрока(МассивДопОпер[0].ЦенаА3) Тогда
		ЭтаФорма.Элементы.ЦенаА3.Заголовок=МассивДопОпер[0].ЦенаА3;
	КонецЕсли;
//4
	Если Не ПустаяСтрока(МассивДопОпер[0].ЦенаА4) Тогда
		ЭтаФорма.Элементы.ЦенаА4.Заголовок=МассивДопОпер[0].ЦенаА4;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВспомогательнаяОперацияПриИзменении(Элемент)
	МассивДопОпер=ПолучитьДополнительныеОперации(Запись.Операция);
	ИзменениеНаименованийКолонокДО(МассивДопОпер);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МассивДопОпер=ПолучитьДополнительныеОперации(Запись.Операция);
	ИзменениеНаименованийКолонокДО(МассивДопОпер);
КонецПроцедуры
